Sudrien/m5tab5_defeatist_music_player/sdkconfig.defaults
# esp_log_level_set() is a no-op without this on IDF v6.
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# --- decode ---------------------------------------------------------
#
# minimp3 is float by default. On the classic ESP32 that was
# disqualifying; the P4 has a single-precision FPU and the float path is
# both faster and more accurate than minimp3's fixed-point fallback, so
# it is left on. Nothing to configure -- this note exists so the absence
# of a MINIMP3_FLOAT define is read as a decision rather than an
# oversight.
#
# esp_audio_codec's decoders want roughly 20 KB of stack in whichever
# task calls them. play_file() runs on the main task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# Do not register esp_audio_codec's MP3 decoder. decoder.c routes every
# .mp3 to our vendored minimp3 instead, so registering theirs would only
# add a decoder nothing can reach.
#
# This does NOT resolve the mp3dec_init/mp3dec_decode_frame link
# collision, which was the original reason this line was added. The
# component ships as a precompiled archive; the Kconfig option controls
# the registration source, not the archive member, so the duplicate
# symbols survive it. minimp3_prefix.h is what actually fixes that.
CONFIG_AUDIO_DECODER_MP3_SUPPORT=n

# --- the radio, which is a C6 on the other end of SDIO2 ----------------
#
# DEFER ESP-HOSTED'S INIT UNTIL app_main().
#
# esp_hosted otherwise brings the transport up from a pre-main hook, and
# on this board that cannot work: WLAN_3.3V is a load switch enabled by
# P0 of the expander at 0x44, and nothing writes that bit until app_main()
# has an I2C handle to write it with. The log of an unpatched build is
# unambiguous -- the transport starts at 1092 ms, main_task at 1096, and
# every sdmmc_card_init that follows fails against a module with no power.
#
# It also makes the Wi-Fi switch honest. settings_wifi_enabled() defaults
# false and claims that with it off nothing starts the radio; a pre-main
# hook runs before settings_init() has read the file, so the claim would
# be false the moment this dependency was added. The first build proved
# it: "Wi-Fi is off; C6 left unpowered" was logged while SDIO retried for
# another three seconds.
#
# This is upstream's own switch for the problem -- their
# mcu_transport_config example sets it for the same reason -- which is
# why the cmake patch that used to edit the constructor out of
# managed_components/ is gone. wifi.c calls esp_hosted_init() itself.
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n

# THE BOARD. esp_hosted carries a Tab5 preset and it was not selected --
# CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y in the sdkconfig of the build that
# failed. Selecting it here rather than asking anyone to find it in a menu:
# a board's wiring is not a choice on hardware that is already soldered.
CONFIG_ESP32P4_TAB5_C6_BOARD=y

# THE RESET LINE, WHICH IS NOT PART OF THE SDIO PIN CONFIG.
#
# This is the one wifi.c could not fix from code. esp_hosted_sdio_set_config()
# carries a pin_reset field, but the port reads the reset line from
# H_GPIO_PIN_RESET -- the Kconfig symbol -- not from that struct, so the
# runtime override set every data pin correctly and left reset at 54.
#
# On this board the C6's EN is SOC_EXTRF_RST on GPIO15, with a 10K pulldown.
# Left at 54 the module is never released: the SDIO peripheral configures
# against pins that are wired to a chip held in reset, "bus backend up" is
# logged, and the first RPC -- esp_wifi_init() -- waits five seconds for a
# reply from something that is not running.
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=15

# AND ITS POLARITY, WHICH IS ACTIVE LOW -- upstream's default, and the
# opposite of what this file briefly said.
#
# The port's reset pulses and then PARKS at the inactive level:
#
#     gpio_set_level(pin, RESET_VAL_INACTIVE);
#     delay; gpio_set_level(pin, RESET_VAL_ACTIVE);      /* the pulse */
#     delay; gpio_set_level(pin, RESET_VAL_INACTIVE);    /* parks here */
#
# GPIO15 is the C6's EN, and EN must be left HIGH for the module to run.
# Active low gives active=0, inactive=1, so the pin parks high and the C6
# runs. Active high parks it LOW, which switches the module off a
# millisecond after pulsing it on -- fifteen sdmmc_card_init failures,
# which is what that setting produced here.
#
# The override exists for boards whose EN is behind an inverting
# transistor. This one is not: SOC_EXTRF_RST reaches EN through R4 with a
# 10K pulldown and nothing in between.
#
# Set explicitly rather than left to the default, because it was wrong
# once and a comment on an absent line cannot say why.
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y

# Room for the three NIST servers wifi.c asks for. The default is 1, and
# it sizes the array that ESP_SNTP_SERVER_LIST initialises -- exceeding it
# is only a warning, so the extra servers are dropped and the build
# succeeds with one source instead of three. Keep in step with
# NTP_SERVER_COUNT in wifi.c.
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# ---------------------------------------------------------------------------
# NETWORK MEMORY OUT OF INTERNAL RAM -- AN EXPERIMENT, FROM THE STREAM PROBE.
#
# Internal RAM is about 100 KB free once the player is up. One TLS session
# took 45 KB of it, and with a 512 kbit/s AAC stream running the ESP-Hosted
# host logged "mempool OOM start (RX)" every second or so, twice stalled for
# about ten seconds with TX and RX both starved, and delivered 0.15-0.73x
# real time. Internal free was 46 KB with the session up and its minimum
# fell to 38 KB. The hypothesis is that TLS and lwIP buffers are crowding
# out the transport's own; these two move the first two to PSRAM, and the
# probe logs internal heap every five seconds to say whether it helped.
#
# sdkconfig.defaults does not override an existing sdkconfig. `rm sdkconfig`
# before building; `idf.py fullclean` does not touch it. The first flash
# after this was added still had CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y and
# TRY_ALLOCATE_WIFI_LWIP unset, and so measured nothing.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

